



1 страницы товара общая single-product-php - ( помощяю на уровне woocomrs) папки не скидую
   общий блок тут будет секция моя конейнер и хлебные крошки



2 вывод содержимого страницы одного товара content-single-product ( помощяю на уровне woocomrs) папки не скидую
   content-single-product  !!!!!весь код тут будет кроме сладера там где картинки товара 
   


   <div id="product-<?php the_ID(); ?>" <?php wc_product_class('сюда ставить общий конейнер ', $product); ?>> сторока кода находиться в этом же файле


3 блок  с картинкой  (там где салйдер ) кастомизирывать папке блок с картиной есть инфа 
  Там только сладйер кастомизируется без содержимого о товаре  