1 Создаю страницу Сheckout вордпресе
2 админке зАйти настройки вокомерса , дополнительно,
страница аформления и выбрать страницу ту которую создал

3 тему скинуть template-checkout.php и свзять эту страницу
<?php /*Template name: checkout*/ ?> и подключить в адмике

4 Шаблоне чекаут, форма подключается через шорт код
Формой я могу манипулировать через хуки они есть папке inc (там все описанно)

5 Форма оформлении заказа
(кастомизируется вручную , а именно кастомизирую классы вокомерса в SCSS) ,
не смогу создать свои
так как сломаю форму