Если нужно менять логику, именно добавлять пароль при создании акаунта , тогда вокомерсе , параметрах, акаунты и приватность , 
снять галочку из Отправить ссылку для установки пароля (рекомендуется) (нужно убрать)
Для того что бы можно было создать пароль , и база данных иго заполнила

Иначе пре регестрации когда я попробую зайти  повтороно на акаунт , будет говорить что я не вел правильно пароль



1 папку myaccount переместить вокомерс 
  1 form-login - тут авторизация , и регестрация 
  2 form-lost-password  - тут забыли пароль
  (кастомизирую под себя)
  
2 стили , и жс пот  кастомизирую тоже под себя ( стили жс которы  есть они сделанны потшаблон как пример)

