Сделанно через аякс 

на бекенде будет создаватся поле админке  ( будет результат что вели форму )
будет записываться базу даных и отпралять на 
имейл  и телеграмм через апи

в жс потключена дополнительно библиотека  маска на телефон 


1 обьеденяем php и жс 
2 идем корень проекта  там где   wp-config.php  на єтом уровне 
3 скидывем  на этот уровень git игнорм  
4 создаем скидываем env.php там будем хранить ключи 
5 wp-config.php  потключаем наши ключи 
6 выводим ключи у себя где нужно 








