1 перехожу сюда  https://t.me/BotFather
2 newbot выбераю  из списка, создаю бота имя ему пишу конце нжуно что бы было bot или  Bot  пример (textBot) 
3  Пишу боту который создался 3 собщения ( он зарегистрыровался)
4 дальше мы получаем      Use this token to access the HTTP API:  этот ключ я буду хранить  env.php
5 пишем браузер юрл     
https://api.telegram.org/bot8236420376:AAHuRRqK1dw6BMkAGjtaXzuE7zmWu-wY3Z0/getUpdates  (пример)
bot8236420376:AAHuRRqK1dw6BMkAGjtaXzuE7zmWu-wY3Z0 место этого пишем нашого бота апи который мы получили при создании бота  дальше джейсо откроется браузере нам нужно получить
id увидить  пример      {"message_id":3,"from":{"id":726820216, 
тамкой же нужно id для нашего  бота которого мы создали, что бы приходили к нему собщения от аякс  формы 






