
esl_attr( )Экранирует текст для использования в атрибутах HTML.
esc_html() Экранирует текст для безопасного вывода в HTML. Преобразует специальные символы в HTML-сущности.
esc_url()  Экранирует URL для безопасного использования в ссылках и других HTML-атрибутах.
esc_textarea()  Экранирует текст для использования внутри <textarea>
wp_kses()  тот html который мы розрешаем 

для js 

esc_js(): Экранирует текст для использования внутри JavaScript.
wp_json_encode(): Преобразует данные в формат JSON с экранированием для использования в JavaScript.