Корзина находиться cart.php
бекенд аякса находиться cart-backend
фроентед весь находиться cart.js
стили cart.scss

смотерть папку хуки может что то будет нужно хуках для корзины


------------------

1 Подключаю к вукомерсу файлы , сart.php и cart-backend
2 файле footer.php после <?php wp_footer(); ?> строки кода добавляю <?php cart(); ?> фунцию карт
3 На кнопку которая должна вызывать корзину вешаю класс .cart-user
корзина должна появиться если корзина не появляется , значит вокомерсе не подключил файлы пунтк номер 1