Корзина находиться fuction.php
бекенд аякса находиться  cart_bekend
фроентед  весь находиться cart.js

смотерть папку хуки может что то будет нужно хуках для корзины


------------------

1 fuction php беру корзину заменяю логику корзинны на ту php на свою которая сверстаная проекте 
2 cart.js   функции updateCartUI функции меняю корзнину которая из проекта  (что бы когда приходил из аякс ответ меняло на мою корзину из проекта )

3 1 функции те которые которые нужны меняю свои классы из проекта 
  2 добавляю логикук которая нужна 

какие есть функци что делают 
1 добавление товара категории сразу корзину
2 добавление товара из карточки товара 
3 селект который добавляет из карточки товара  товар количество 
4 корзине селект который добавляет товар по нажатию селекта уберает и вручную товар добавляет на импут нажимаю 
5 удаление товара из корзины
6 вывод общей ценны



css не нету  (если сделанно так как я указал по очередности то карзина подтяниться уже из проекта (стили будут уже проектнные))