1 Нужно ключить пагиннацию для кометарий (админке вп, что бы появился пагинация на сайте для кометрей)
Ключить : обсуждение (Разбиение комментариев на страницы) поставить галочку

2 Кастомизация кометарей:
single-product-reviews - файл вокомерса ( для коментарей Нем кастомизация:

1 Коментари
2 Рейтинг (звезды)
3 оставить рейтинг (звезды)

)

3 Что хуках в них :

1 хук удаляет табы (базовые)
2 выводит кометарии
3 функция Ввыодит в single-product-reviews ввыводит кометарии и рейтинг (под разметку кастомную , дефотными классами )



4 Js
проверка: что бы
1 Юзер не мог оставить кометар без рейтинга
2 юзер не оставлял такой же кометар копию
3 Рейтиг (при клике добавлялся актив на звздочку)